#include "map.h"

char map[22*20] = {0};

void reset_map()
{
    // Заполняет всё поле пробелами
    for ( uint16_t i = 0; i < 21*20; i++ )
        map[i] = ' ';

    // Добавляет \r\n в конце строк
    for ( uint16_t i = 0; i < 20; i++ )
    {
        map[22*i+20] = '\r';
        map[22*i+21] = '\n';
    }

    // Верхняя и нижняя границы
    for ( uint16_t i = 0; i < 20; i++ )
    {
        map[i] = '_';
        map[22*19+i] = '_';
    }
    
    // Боковые границы
    for ( uint16_t i = 1; i < 19; i++ )
    {
        map[i*22] = '|';
        map[i*22+19] = '|';
    }
}
